app/views/users/show.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`user_id` = 1
---
<h2>ユーザーの投稿一覧</h2>
<% @user.comments.each do |t| %>

SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1
---
<h2>ユーザーがいいねした投稿一覧</h2>
<% @user.liked_posts.each do |t| %>