app/views/users/show.html.erb

              <div class="new-kissan-heart-box">
                <i class="far fa-heart heart-icon"></i><%= n.post.likes.count %>
---
SELECT `posts`.* FROM `posts` INNER JOIN `likes` ON `posts`.`id` = `likes`.`post_id` WHERE `likes`.`user_id` = 2