app/views/posts/index.html.erb

      <%= link_to "喫茶店詳細", post_path(p.id) %>
      <i class="far fa-heart"></i><%= p.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 1