app/views/posts/show.html.erb

      <% end %>
      <i class="far fa-comment comment-icon"></i><%= @post.comments.count %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 3