app/controllers/comments_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`content`, `image`, `user_id`, `post_id`, `created_at`, `updated_at`) VALUES ('あいうえお', 'コーヒーサイフォン.jpg', 1, 1, '2021-01-09 14:00:08.488093', '2021-01-09 14:00:08.488093')
---
    def create
        post = Post.find(params[:post_id])
        comment = post.comments.build(comment_params) #buildを使い、contentとpost_idの二つを同時に代入
        comment.user_id = current_user.id
        if comment.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 8 LIMIT 1
---
    def edit
      @post = Post.find(params[:post_id])
      @comment = Comment.find(params[:id])

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 26 LIMIT 1
UPDATE `comments` SET `comments`.`content` = 'かきくけこ', `comments`.`updated_at` = '2021-01-04 12:00:27.601198' WHERE `comments`.`id` = 26
---
    def update
      @post = Post.find(params[:post_id])
      @comment = Comment.find(params[:id])

      if @comment.update(comment_params)

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 26 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 22
---
    def destroy
      @post = Post.find(params[:post_id])
      @comment = Comment.find(params[:id])

      if @comment.destroy