app/controllers/nices_controller.rb

INSERT INTO `nices` (`comment_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 3, '2020-12-08 03:08:22.365574', '2020-12-08 03:08:22.365574')
---
    def create
        nice = current_user.nices.create(comment_id: params[:comment_id]) #user_idとcomment_idの二つを代入

SELECT `nices`.* FROM `nices` WHERE `nices`.`comment_id` = 6 AND `nices`.`user_id` = 3 LIMIT 1
DELETE FROM `nices` WHERE `nices`.`id` = 6
---
    def destroy
        nice = Nice.find_by(comment_id: params[:comment_id], user_id: current_user.id)
        nice.destroy