app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE (name LIKE '%長原拓%')
SELECT COUNT(*) FROM (SELECT 1 AS one FROM `posts` WHERE ((name LIKE '%喫茶%') OR (prefecture LIKE '%喫茶%' )) LIMIT 3 OFFSET 0) subquery_for_count
SELECT `posts`.* FROM `posts` WHERE ((name LIKE '%喫茶%') OR (prefecture LIKE '%喫茶%' )) LIMIT 3 OFFSET 0
---
    def index
        @qsearch = Post.search(search_params)
        @posts = @qsearch.result(distinct: true)
        @posts = Post.all.page(params[:page]).per(3)

INSERT INTO `posts` (`name`, `prefecture`, `address`, `tel`, `hp`, `business_hours`, `created_at`, `updated_at`, `user_id`, `wifi`) VALUES ('喫茶1', '', '', '', '', '', '2021-01-09 14:59:09.389164', '2021-01-09 14:59:09.389164', 1, '0')
---
    def create
        post = Post.new(post_params)

        post.user_id = current_user.id

        if post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
UPDATE `posts` SET `posts`.`business_hours` = '月', `posts`.`updated_at` = '2020-12-06 13:28:26.712914' WHERE `posts`.`id` = 3
---
    def update
      post = Post.find(params[:id])

      if post.update(post_params)

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 1
---
    def destroy
        post = Post.find(params[:id])
        post.destroy