app/controllers/posts_controller.rb

    def show
        @post = Post.find(params[:id])
        @comments = @post.comments
        @comments = @comments.page(params[:page]).per(3)
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1