app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`user_id` = 1
---
    def show
        @user = User.find(params[:id])
        @userlikes = @user.likes
        @userlikes = @userlikes.page(params[:page]).per(3)
        @usercomments = @user.comments
        @usercomments = @usercomments.page(params[:page]).per(3)