app/models/user.rb

SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 2 AND `likes`.`post_id` = 1 LIMIT 1
---
  def already_liked?(post)
    self.likes.exists?(post_id: post.id)

SELECT 1 AS one FROM `nices` WHERE `nices`.`user_id` = 2 AND `nices`.`comment_id` = 1 LIMIT 1
---
  def already_niced?(comment)
    self.nices.exists?(comment_id: comment.id)